# Data Analysis 101 - Pandas

Alex Chen

Source:

https://github.com/allisonhorst/palmerpenguins/tree/main

https://www.kaggle.com/datasets/parulpandey/palmer-archipelago-antarctica-penguin-data

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# 1. 讀入資料

In [2]:
df1 = pd.read_csv('penguins_info.csv')

In [3]:
df2 = pd.read_excel('penguins_measurements.xlsx')

# 2. 資料概覽

In [5]:
df1 # 直接輸入 df1 可檢視資料

      ID                              Species     Island     Sex
0      1  Adelie Penguin (Pygoscelis adeliae)  Torgersen    MALE
1      2  Adelie Penguin (Pygoscelis adeliae)  Torgersen  FEMALE
2      3  Adelie Penguin (Pygoscelis adeliae)  Torgersen  FEMALE
3      4  Adelie Penguin (Pygoscelis adeliae)  Torgersen     NaN
4      5  Adelie Penguin (Pygoscelis adeliae)  Torgersen  FEMALE
..   ...                                  ...        ...     ...
339  340    Gentoo penguin (Pygoscelis papua)     Biscoe     NaN
340  341    Gentoo penguin (Pygoscelis papua)     Biscoe  FEMALE
341  342    Gentoo penguin (Pygoscelis papua)     Biscoe    MALE
342  343    Gentoo penguin (Pygoscelis papua)     Biscoe  FEMALE
343  344    Gentoo penguin (Pygoscelis papua)     Biscoe    MALE

[344 rows x 4 columns]

In [26]:
df1.head() # 顯示前五筆資料

   ID                              Species     Island     Sex
0   1  Adelie Penguin (Pygoscelis adeliae)  Torgersen    MALE
1   2  Adelie Penguin (Pygoscelis adeliae)  Torgersen  FEMALE
2   3  Adelie Penguin (Pygoscelis adeliae)  Torgersen  FEMALE
3   4  Adelie Penguin (Pygoscelis adeliae)  Torgersen     NaN
4   5  Adelie Penguin (Pygoscelis adeliae)  Torgersen  FEMALE

In [25]:
df1.describe() # 數值型資料的描述性統計

               ID
count  344.000000
mean   172.500000
std     99.448479
min      1.000000
25%     86.750000
50%    172.500000
75%    258.250000
max    344.000000

In [6]:
df1.info() # 資料的資訊

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ID       344 non-null    int64
 1   Species  344 non-null    object
 2   Island   344 non-null    object
 3   Sex      334 non-null    object
dtypes: int64(1), object(3)
memory usage: 10.9+ KB

In [7]:
df1.dtypes # 欄位的資料型態

ID          int64
Species    object
Island     object
Sex        object
dtype: object

In [10]:
df1['Species'].value_counts() # 類別型資料的計數

Species
Adelie Penguin (Pygoscelis adeliae)          152
Gentoo penguin (Pygoscelis papua)            124
Chinstrap penguin (Pygoscelis antarctica)     68
Name: count, dtype: int64

In [8]:
df2.head()

,ID,Culmen Length (mm),Culmen Depth (mm),Flipper Length (mm),Body Mass (g)
0,1,39.1,18.7,181.0,3750.0
1,2,39.5,17.4,186.0,3800.0
2,3,40.3,18.0,195.0,3250.0
3,4,NaN,NaN,NaN,NaN
4,5,36.7,19.3,193.0,3450.0

In [9]:
df2.dtypes

ID                       int64
Culmen Length (mm)     float64
Culmen Depth (mm)      float64
Flipper Length (mm)    float64
Body Mass (g)          float64
dtype: object

In [11]:
df2['Body Mass (g)'].min()

np.float64(2700.0)

In [12]:
df2['Body Mass (g)'].max()

np.float64(6300.0)

In [15]:
df2['Body Mass (g)'].mean()

np.float64(4201.754385964912)

In [13]:
df2['Body Mass (g)'].std()

np.float64(801.9545356980956)

In [14]:
df2['Body Mass (g)'].median()

np.float64(4050.0)